{
    "pahlawan": [
      {
        "nama": "R.A. Kartini",
        "tanggal_lahir": "21 April 1879",
        "tanggal_meninggal": "17 September 1904",
        "provinsi": "Jawa Barat",
        "perjuangan": "Raden Ayu Adipati Kartini Djojoadhiningrat (21 April 1879 – 17 September 1904) atau sering disebut dengan gelarnya sebelum menikah: Raden Ajeng Kartini, adalah seorang tokoh Jawa dan Pahlawan Nasional Indonesia.[1] Kartini adalah seorang pejuang kemerdekaan dan kedudukan kaumnya, pada saat itu terutama wanita Jawa.[2]Ia mempunyai tanggal lahir yang sama seperti dr. Radjiman Wedyodiningrat, yakni sama-sama lahir pada 21 April 1879.Ia dilahirkan dalam keluarga bangsawan Jawa di Hindia Belanda (sekarang Indonesia). Setelah bersekolah di sekolah dasar berbahasa Belanda, ia ingin melanjutkan pendidikan lebih lanjut, tetapi perempuan Jawa saat itu dilarang mengenyam pendidikan tinggi. Ia bertemu dengan berbagai pejabat dan orang berpengaruh, termasuk J.H. Abendanon, yang bertugas melaksanakan Kebijakan Etis Belanda."
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/COLLECTIE_TROPENMUSEUM_Portret_van_Raden_Ajeng_Kartini_TMnr_10018776.jpg/330px-COLLECTIE_TROPENMUSEUM_Portret_van_Raden_Ajeng_Kartini_TMnr_10018776.jpg"
      },
      {
        "nama": "Soekarno",
        "tanggal_lahir": "6 Juni 1901",
        "tanggal_meninggal": "21 Juni 1970",
        "provinsi": "DKI Jakarta",
        "perjuangan": "Dr. (H.C.) Ir. H. Soekarno[cat.] (Ejaan Republik: Sukarno, Jawa: ꦯꦸꦑꦂꦟ; pengucapan bahasa Jawa: [suːˈkarnɔ])[2] (6 Juni 1901 – 21 Juni 1970)[cat. 1][cat. 2] adalah Presiden pertama Republik Indonesia yang menjabat pada kurun waktu 1945–1967.[7]:11, 81 Ia adalah seorang tokoh perjuangan yang berperan penting dalam memerdekakan bangsa Indonesia dari kolonialisme Belanda.[8]:26-32 Bersama Mohammad Hatta, ia memproklamasikan Kemerdekaan Indonesia pada tanggal 17 Agustus 1945. Soekarno orang pertama yang mencetuskan konsep mengenai Pancasila sebagai dasar negara Indonesia dan ia sendiri yang menamainya.[8]"
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Presiden_Sukarno.jpg/330px-Presiden_Sukarno.jpg"
      },
      {
        "nama": "Diponegoro",
        "tanggal_lahir": "11 November 1785",
        "tanggal_meninggal": "8 Januari 1855",
        "provinsi": "Jawa Tengah",
        "perjuangan": "Bendara Pangeran Harya Diponegara (atau biasa dikenal dengan nama Pangeran Diponegoro, 11 November 1785 – 8 Januari 1855) adalah salah seorang pahlawan nasional Republik Indonesia, yang memimpin Perang Diponegoro atau Perang Jawa selama periode tahun 1825 hingga 1830 melawan pemerintah Hindia Belanda."
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Diponegoro.jpg/330px-Diponegoro.jpg"
      },
      {
        "nama": "Raden Patah",
        "tanggal_lahir": "Belum diketahui",
        "tanggal_meninggal": "Belum diketahui",
        "provinsi": "Jawa Timur",
        "perjuangan": "Raden Patah alias Jin Bun (Jawa : ꦫꦢꦺꦤ꧀ꦦꦠꦃ, Hanzi : 靳文, Pinyin : Jìn Wén) bergelar Panembahan Jimbun (lahir: Palembang, 1455; wafat: Demak, 1518) adalah pendiri dan sultan Demak pertama yang memerintah tahun 1500-1518.Menurut kronik Tiongkok dari Kuil Sam Po Kong Semarang, ia adalah keturunan Tionghoa dan memiliki nama kecil Jin Bun tanpa nama marga di depannya, karena hanya ibunya saja yang berdarah Tionghoa. Jin Bun memiliki arti orang yang kuat.[1]"
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Illustration_of_Raden_Patah.jpg/330px-Illustration_of_Raden_Patah.jpg"
      },
      {
        "nama": "Tirtayasa",
        "tanggal_lahir": "1631",
        "tanggal_meninggal": "1692",
        "provinsi": "Banten",
        "perjuangan": "Tirtayasa dari Banten (lahir di Kesultanan Banten, 1631 – meninggal di Batavia, Hindia Belanda, 1692 pada umur 60–61 tahun)[1] adalah sultan Banten ke-6. Ia naik takhta pada usia 20 tahun menggantikan kakeknya, Sultan Abdul Mafakhir yang wafat pada tanggal 10 Maret 1651, setelah sebelumnya ia diangkat menjadi Sultan Muda dengan gelar Pangeran Adipati atau Pangeran Dipati, menggantikan ayahnya[2] yang wafat lebih dulu pada tahun 1650.[3] Pada tahun 2017 sutradara Darwin Mahesa mengangkat film Tirtayasa The Sultan of Banten bergenre dokudrama yang diproduksi oleh Kremov Pictures.[4]"
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/id/thumb/d/dc/Lukisan_Sultan_Ageng_Tirtayasa_oleh_Kang_Alam.jpg/330px-Lukisan_Sultan_Ageng_Tirtayasa_oleh_Kang_Alam.jpg"
      },
      {
        "nama": "Sultan Hamengkubuwono IX",
        "tanggal_lahir": "12 April 1912",
        "tanggal_meninggal": "2 Oktober 1988",
        "provinsi": "DI Yogyakarta",
        "perjuangan": "Jenderal TNI. (Tit.) H. Sri Sultan Hamengkubuwana IX (Jawa: ꦲꦩꦼꦁꦏꦸꦨꦸꦮꦤ꧇꧙꧇; 12 April 1912 – 2 Oktober 1988,[a] lahir dengan nama Gusti Raden Mas Dorodjatun) adalah Sultan Yogyakarta kesembilan dan Gubernur Daerah Istimewa Yogyakarta yang pertama. Ia merupakan Wakil Presiden Indonesia kedua yang menjabat pada tahun 1973–1978. Hamengkubuwana IX juga merupakan Ketua Kwartir Nasional Gerakan Pramuka yang pertama dan dikenal sebagai Bapak Pramuka Indonesia."
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Hamengkubawono_IX_Official_Portrait.jpg/330px-Hamengkubawono_IX_Official_Portrait.jpg"
      },
      {
        "nama": "I Gusti Ngurah Rai",
        "tanggal_lahir": "30 Januari 1917",
        "tanggal_meninggal": "20 November 1946",
        "provinsi": "Bali",
        "perjuangan": "Brigadir Jenderal TNI (Anumerta) I Gusti Ngurah Rai (30 Januari 1917 – 20 November 1946) adalah seorang tokoh militer Indonesia, yang berjasa dalam Perang Kemerdekaan. Ia merupakan pendiri dan panglima pertama satuan angkatan bersenjata Republik Indonesia di Kepulauan Sunda Kecil, yang memimpin langsung perlawanan bersenjata anti-Belanda di Bali. Ia gugur pada bulan November 1946 dalam pertempuran dengan pasukan Belanda di dekat desa Marga, Bali tengah."
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Lukisan_I_Gusti_Ngurah.jpg/330px-Lukisan_I_Gusti_Ngurah.jpg"
      },
      {
        "nama": "Muhammad Zainuddin Abdul Madjid",
        "tanggal_lahir": "15 September 1919",
        "tanggal_meninggal": "4 Januari 2002",
        "provinsi": "Nusa Tenggara Barat (NTB)",
        "perjuangan": "Maulānā Syāikh Tuan Guru Kyai Hajjī Muhammād Zainuddīn Abdul Madjīd (5 Agustus 1898 – 21 Oktober 1997) adalah seorang ulama karismatis dari Pulau Lombok, Nusa Tenggara Barat dan merupakan pendiri Nahdlatul Wathan, organisasi massa Islām terbesar di provinsi tersebut. Di pulau Lombok, Tuan Guru merupakan gelar bagi para pemimpin agama yang bertugas untuk membina, membimbing dan mengayomi umat Islām dalam hal-hal keagamaan dan sosial kemasyarakatan, yang di Jawa identik dengan Kyai.Seperti Hamka, beliapun memiliki nama singkatan, yaitu Hamzanwadi (Hajji Muhammād Zainuddīn Abdul Madjīd Nahdlatul Wathan Dīniyah Islāmiyah)."
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/id/c/cd/Hamzanwadi.jpg"
      },
      {
        "nama": "El Tari",
        "tanggal_lahir": "1 Januari 1926",
        "tanggal_meninggal": "30 Desember 2005",
        "provinsi": "Nusa Tenggara Timur (NTT)",
        "perjuangan": "Mayor Jenderal TNI Anumerta Elias Tari (18 April 1926 – 29 April 1978) adalah Gubernur Nusa Tenggara Timur periode 12 Juli 1966 sampai kematiannya 29 April 1978. Ia menjadi Gubernur NTT menggantikan W. J. Lalamentik.Kebijakan yang dilaksanakan adalah membentuk Desa Gaya Baru dari Kerajaan-kerajaan Tradisional. Terkenal dengan motto: Tanam, Tanam, sekali lagi Tanam!"
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/commons/6/65/Gubernur_NTT_El_Tari.png"
      }
    ]
  }
  