{
    "pahlawan": [
      {
        "nama": "Martha Christina Tiahahu",
        "tanggal_lahir": "10 Januari 1800",
        "tanggal_meninggal": "2 Januari 1818",
        "provinsi": "Maluku",
        "perjuangan": "Martha Christina Tiahahu (4 Januari 1800 – 2 Januari 1818) adalah seorang gadis dari desa Abubu,Nusalaut, Maluku Tengah. Pada usia 17 tahun, ia ikut mengangkat senjata melawan tentara Belanda. Ayahnya adalah Kapitan Paulus Tiahahu, seorang kapitan dari negeri Abubu yang membantu Thomas Matulessy dalam Perang Pattimura pada 1817.[1]",
        "fotourl": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Martha_Christina_Tiahahu.jpg/330px-Martha_Christina_Tiahahu.jpg"
      },
      {
        "nama": "Andi Sultan Daeng Radja",
        "tanggal_lahir": "12 Oktober 1903",
        "tanggal_meninggal": "21 Januari 1965",
        "provinsi": "Sulawesi Selatan",
        "perjuangan": "Usai mengikuti rapat PPKI, Sultan Daeng Radja, langsung pulang ke Bulukumba untuk memberi penjelasan kepada rakyatnya mengenai hasil rapat PPKI dan menyusun rencana dalam rangka menindaklanjuti persitiwa bersejarah kemerdekaan RI. Kabar kemerdekaan RI yang disampaikan Sultan Daeng Radja, disambut rasa haru dan gembira oleh seluruh rakyat Bulukumba.Akhir Agustus 1945, Sultan Daeng Radja mengusulkan pembentukan organisasi Persatuan Pergerakan Nasional Indonesia (PPNI). Organisasi ini, dipimpin Andi Panamun dan Abdul Karim. PPNI dibentuk sebagai wadah menghimpun pemuda dalam rangka mengamankan dan membela Negara Indonesia.",
        "fotourl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Sultan-dg-raja.jpg/330px-Sultan-dg-raja.jpg"
      },
      {
        "nama": "Jusuf Kalla",
        "tanggal_lahir": "15 Mei 1942",
        "tanggal_meninggal": "-",
        "provinsi": "Sulawesi Selatan",
        "perjuangan": "Dr. (H.C.) Drs. H. Muhammad Jusuf Kalla (lahir 15 Mei 1942) adalah seorang wirausahawan asal Indonesia. Dalam kiprahnya berpolitik, ia bergabung dengan Partai Golongan Karya dan pernah menjabat sebagai Wakil Presiden Indonesia selama dua periode masa jabatan secara tidak berturut-turut. Periode pertamanya, pria yang populer dengan nama akronim JK ini maju sebagai calon wakil presiden mendampingi Susilo Bambang Yudhoyono. Keduanya merupakan rekan dalam Kabinet Gotong Royong. Mereka berhasil memenangkan Pemilu Presiden 2004.",
        "fotourl": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Jusuf_Kalla_2016_vice-presidential_portrait.jpg/300px-Jusuf_Kalla_2016_vice-presidential_portrait.jpg"
      },
      {
        "nama": "Johannes Latuharhary",
        "tanggal_lahir": "6 Juli 1900",
        "tanggal_meninggal": "8 November 1959",
        "provinsi": "Maluku",
        "perjuangan": "Mr. Johannes Latuharhary (6 Juli 1900 - 8 November 1959) adalah seorang politikus dan perintis kemerdekaan Indonesia. Ia menjabat sebagai Gubernur Maluku pertama (1950–1955) dan memperjuangkan masuknya Maluku ke dalam NKRI.Johannes lahir di Saparua, Maluku, dan sebagai remaja ia pindah ke Batavia untuk pendidikan lanjut. Belakangan, ia memperoleh beasiswa untuk belajar ilmu hukum di Universitas Leiden. Sepulangnya ke tanah air, ia menjadi hakim di Jawa Timur dan mulai turut serta dalam pergerakan kebangkitan nasional Indonesia melalui organisasi pemuda Sarekat Ambon (SA). Ia belakangan berhenti menjadi hakim dan pindah menjadi advokat, selagi bergerak di sisi politik untuk mengikutsertakan SA dalam perjuangan kemerdekaan Indonesia. Selama zaman Jepang, Johannes bekerja di bawah departemen urusan dalam negeri di Jakarta dan ditahan Jepang tiga kali dengan berbagai macam alasan. Ia turut serta dalam penulisan UUD 1945 sebagai anggota Badan Peny",
        "fotourl": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Johannes_Latuharhary%2C_Kami_Perkenalkan_%281954%29%2C_p54.jpg/330px-Johannes_Latuharhary%2C_Kami_Perkenalkan_%281954%29%2C_p54.jpg"
      },
      {
        "nama": "bu Agung Hj. Andi Depu",
        "tanggal_lahir": "1 Agustus 1907",
        "tanggal_meninggal": "18 Juni 1985",
        "provinsi": "Sulawesi Barat",
        "perjuangan": "Andi Depu Maraddia Balanipa,[1] Puang Depu Maraddia Balanipa[2] atau Ibu Agung (1 Agustus 1907 - 18 Juni 1985)[3] adalah seorang pejuang wanita asal Indonesia. Ia berhasil mempertahankan Tinambung, Afdeling Polewali dari penaklukan Belanda.[2] Pada 1942, ia mengibarkan bendera Merah Putih pada awal kedatangan pasukan Jepang di Tanah Mandar.[2] Ia mendapatkan anugerah Bintang Mahaputra Tingkat IV dari Presiden Soekarno.[4]Pada 10 November 2018, ia dianugerahi gelar Pahlawan Nasional Indonesia oleh Presiden Joko Widodo bersama dengan Abdurrahman Baswedan, Kasman Singodimedjo, Depati Amir, Sjam'un dan Pangeran Muhammad Noor.[5]"
        ,"fotourl" : "https://3.bp.blogspot.com/-3pi_Y4jUC5Y/Tqu_HCGdMgI/AAAAAAAAAJo/iWxQCP2iJKQ/s1600/Screenshot%2B%252821h%2B57m%2B17s%2529.jpg"
      },
      {
        "nama": "Jusuf Habibie",
        "tanggal_lahir": "25 Juni 1936",
        "tanggal_meninggal": "11 September 2019",
        "provinsi": "Sulawesi Selatan",
        "perjuangan": "Prof. Dr.-Ing. Ir. H. Bacharuddin Jusuf Habibie, FREng.[1] (25 Juni 1936 – 11 September 2019)[2] adalah Presiden Republik Indonesia yang ketiga. Sebelumnya, B.J. Habibie menjabat sebagai Wakil Presiden Republik Indonesia ke-7, menggantikan Try Sutrisno. B. J. Habibie menggantikan Soeharto yang mengundurkan diri dari jabatan presiden pada tanggal 21 Mei 1998.[3][4] Sebelum memasuki dunia politik, Habibie dikenal luas sebagai seorang profesor dan ilmuwan dalam teknologi aviasi internasional dan satu-satunya presiden Indonesia hingga saat ini yang berlatarbelakang teknokrat."
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/B._J._Habibie%2C_President_of_Indonesia_portrait.jpg/330px-B._J._Habibie%2C_President_of_Indonesia_portrait.jpg"
      },
      {
        "nama": "Oputa Yi Koo",
        "tanggal_lahir": "1752",
        "tanggal_meninggal": "1776",
        "provinsi": "Sulawesi Tenggara",
        "perjuangan": "La Karambau Sultan Himayatuddin adalah satu-satunya Sultan Buton yang konsisten melakukan perlawanan terhadap kekuasaan Kompeni-Belanda hingga akhir hayatnya selama 24 tahun (1752-1776). Dia bergerilya lama di hutan selama masa perjuangannya dan akhirnya meninggal di puncak Gunung Siontapina, sehingga dikenal dengan sebutan sebagai Oputa yi Koo.   "
        ,"fotourl" : "https://cdn.rri.co.id/berita/58/images/1667999373-OPUTA%20YII%20KOO_WARNA.jpeg"
      },
      {
        "nama": "Idrus bin Salim Al-Jufri",
        "tanggal_lahir": "15 Maret 1892",
        "tanggal_meninggal": "22 Desember 1969",
        "provinsi": "Sulawesi Tengah",
        "perjuangan": "Al-Habib Idrus bin Salim Al-Jufri atau lebih dikenal dengan Sayyid Idrus bin Salim Al-Jufri atau Guru Tua (15 Maret 1892 – 22 Desember 1969)[1][3][4] merupakan tokoh pejuang di Provinsi Sulawesi Tengah dalam bidang pendidikan agama Islam.Sepanjang hidupnya, ulama yang akrab disapa Guru Tua ini dikenal sebagai sosok yang cinta ilmu. Tak hanya untuk diri sendiri, ilmu itu juga ia bagikan kepada orang lain. Salah satu wujud cintanya pada ilmu adalah didirikannya lembaga pendidikan Islam Alkhairaat sebagai sumbangsih nyata Guru Tua kepada agama islam."
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Habib_Idrus_bin_Salim_al-Jufri.jpg/330px-Habib_Idrus_bin_Salim_al-Jufri.jpg"
      },
      {
        "nama": "Sam Ratulangi",
        "tanggal_lahir": "5 November 1890",
        "tanggal_meninggal": "30 Juni 1949",
        "provinsi": "Sulawesi Utara",
        "perjuangan": "Dr. Gerungan Saul Samuel Jacob Ratulangi (5 November 1890 - 30 Juni 1949), atau lebih dikenal dengan nama Sam Ratulangi, adalah seorang politikus, jurnalis, dan guru dari Sulawesi Utara, Indonesia. Ia adalah seorang Pahlawan Nasional Indonesia. Ratulangi juga sering disebut sebagai tokoh multidimensional. Ia dikenal dengan filsafatnya: Si tou timou tumou tou yang artinya: manusia baru dapat disebut sebagai manusia, jika sudah dapat memanusiakan manusia. Ratulangi termasuk anggota Panitia Persiapan Kemerdekaan Indonesia yang menghasilkan Undang-Undang Dasar Republik Indonesia dan merupakan Gubernur Sulawesi pertama."
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Sam_Ratulangi_IPPHOS.jpg/330px-Sam_Ratulangi_IPPHOS.jpg"
      },
      {
        "nama": "Nani Wartabone",
        "tanggal_lahir": "30 April 1907",
        "tanggal_meninggal": "3 Januari 1986",
        "provinsi": "Gorontalo",
        "perjuangan": "H. Nani Wartabone, (30 April 1907 – 3 Januari 1986) adalah putra daerah Gorontalo yang berprofesi sebagai petani dan menjadi tokoh revolusioner perjuangan kemerdekaan Indonesia di Sulawesi. Wartabone juga merupakan sahabat seperjuangan Soekarno dalam merebut kemerdekaan dari tangan penjajah.Wartabone dikenal sebagai Proklamator Kemerdekaan Indonesia di Gorontalo pada tanggal 23 Januari 1942 atau dikenal dengan Hari Proklamasi Gorontalo. Peristiwa ini terjadi lebih awal 3 (tiga) tahun sebelum Proklamasi Kemerdekaan Indonesia pada tahun 1945."
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Portrait_of_Nani_Wartabone%2C_Sulawesi_Utara_Bergolak%2C_p34.jpg/330px-Portrait_of_Nani_Wartabone%2C_Sulawesi_Utara_Bergolak%2C_p34.jpg"
      }
    ]
  }
  