{
    "pahlawan": [
      {
        "nama": "Tuanku Imam Bonjol",
        "tanggal_lahir": "1772",
        "tanggal_meninggal": "6 November 1864",
        "provinsi": "Sumatera Barat",
        "perjuangan": "Tuanku Imam Bonjol (lahir di Bonjol, Luhak Agam, Pagaruyung, 1772 – wafat dalam pengasingan dan dimakamkan di Lotta, Pineleng, Minahasa, 6 November 1864) adalah salah seorang ulama, pemimpin dan pejuang yang berperang melawan Belanda dalam peperangan yang dikenal dengan nama Perang Padri pada tahun 1803–1838.[1] Tuanku Imam Bonjol diangkat sebagai Pahlawan Nasional Indonesia berdasarkan SK Presiden RI Nomor 087/TK/Tahun 1973, tanggal 6 November 1973.[2]Salah satu naskah asli yang memuat riwayat hidup Tuanku Imam Bonjol tersimpan di Dinas Perpustakaan dan Kearsipan Provinsi Sumatra Barat.[3]",
        "fotourl": "https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcQmt3n4ZW5QgsCoD7KUkLoVGgrS2OOaK8-sKJ9OctBNvR6U3_JQ"
      },
      {
        "nama": "Sisingamangaraja XII",
        "tanggal_lahir": "1849",
        "tanggal_meninggal": "17 Februari 1907",
        "provinsi": "Sumatera Utara",
        "perjuangan": "Sisingamangaraja XII dengan nama lengkap Patuan Bosar Sinambela ginoar Ompu Pulo Batu (18 Februari 1845 – 17 Juni 1907) adalah seorang raja di Negeri Toba dan pejuang yang berperang melawan Belanda. Ia diangkat oleh pemerintah Indonesia sebagai Pahlawan Nasional Indonesia pada tanggal 9 November 1961 berdasarkan SK Presiden RI No 590/1961.Semula, ia dimakamkan di Tarutung, Tapanuli Utara, lalu dipindahkan ke Soposurung, Balige, Toba pada tahun 1953.[1]",
        "fotourl": "https://borneo24.com/wp-content/uploads/2021/11/sisingamangaraja-xii.jpg"
      },
      {
        "nama": "Mohammad Hatta",
        "tanggal_lahir": "12 Agustus 1902",
        "tanggal_meninggal": "14 Maret 1980",
        "provinsi": "Sumatera Selatan",
        "perjuangan": "Dr. (H.C.) Drs. H. Mohammad Hatta (12 Agustus 1902 – 14 Maret 1980) adalah seorang tokoh perjuangan kemerdekaan indonesia, pahlawan nasional, negarawan dan ekonom Indonesia yang menjabat sebagai Wakil Presiden Indonesia pertama. Ia bersama Soekarno adalah Proklamator Kemerdekaan, memainkan peranan sentral dalam perjuangan kemerdekaan Indonesia dari penjajahan Belanda sekaligus memproklamirkannya pada 17 Agustus 1945. Ia pernah menjabat sebagai Perdana Menteri dalam Kabinet Hatta I, Hatta II, dan RIS. Pada 1956, ia mundur dari jabatan wakil presiden.",
        "fotourl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/VP_Hatta.jpg/1200px-VP_Hatta.jpg"
      },
      {
        "nama": "Tengku Amir Hamzah",
        "tanggal_lahir": "28 Februari 1911",
        "tanggal_meninggal": "20 Maret 1946",
        "provinsi": "Sumatera Utara",
        "perjuangan": "Tengkoe Amir Hamzah yang bernama lengkap Tengkoe Amir Hamzah Pangeran Indra Poetera, atau lebih dikenal hanya dengan nama pena Amir Hamzah (28 Februari 1911 – 20 Maret 1946) [a] adalah sastrawan Indonesia angkatan Poedjangga Baroe dan Pahlawan Nasional Indonesia. Lahir dari keluarga bangsawan Melayu Kesultanan Langkat di Sumatra Utara, ia dididik di Sumatra dan Jawa. Saat berguru di SMA di Surakarta sekitar 1930, Amir muda terlibat dengan gerakan nasionalis dan jatuh cinta dengan seorang teman sekolahnya, Ilik Soendari. Bahkan setelah Amir melanjutkan studinya di sekolah hukum di Batavia (sekarang Jakarta) keduanya tetap dekat, hanya berpisah pada tahun 1937 ketika Amir dipanggil kembali ke Sumatra untuk menikahi putri sultan dan mengambil tanggung jawab di lingkungan keraton. Meskipun tidak bahagia dengan pernikahannya, dia memenuhi tugas kekeratonannya. Setelah Indonesia memproklamasikan kemerdekaannya pada tahun 1945, ia menjabat sebagai wakil pemerintah di Langkat. Namun siapa nyana, pada tahun pertama negara Indonesia yang baru lahir, ia meninggal dalam peristiwa konflik sosial berdarah di Sumatra yang disulut oleh faksi dari Partai Komunis Indonesia dan dimakamkan di sebuah kuburan massal.",
        "fotourl": "https://pemkomedan.go.id/img_artikel/23Tengku%20Hamzah.jpg"
      },
      {
        "nama": "Raden Dewi Sartika",
        "tanggal_lahir": "4 Desember 1884",
        "tanggal_meninggal": "11 September 1947",
        "provinsi": "Jawa Barat (Pindah ke Sumatera Barat)",
        "perjuangan": "Raden Dewi Sartika (Sunda: ᮛᮓᮦᮔ᮪ ᮓᮦᮝᮤ ᮞᮁᮒᮤᮊ, translit. Radén Déwi Sartika; 4 Desember 1884 – 11 September 1947) adalah seorang advokat dan tokoh perintis pendidikan untuk kaum wanita. Ia juga merupakan salah satu tokoh perempuan Indonesia paling terkenal. Ia diakui sebagai Pahlawan Nasional oleh Pemerintah Indonesia pada tahun 1966.",
        "fotourl": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Raden_Dewi_Sartika.jpg"
      },
      {
        "nama": "Radin Intan II",
        "tanggal_lahir": "Belum diketahui",
        "tanggal_meninggal": "Belum diketahui",
        "provinsi": "Lampung",
        "perjuangan": "Radin Intan II[1] (Aksara Lampung:Aksara-radininten2.png; lahir 1 Januari 1834 – 5 Oktober 1858[2][3]) adalah seorang pahlawan nasional Indonesia. Namanya diabadikan sebagai nama bandara, perguruan tinggi, dan halte busway.Berdasarkan penelitian, Radin Intan II masih keturunan Fatahillah yang dikenal sebagai Sunan Gunung Jati dari perkawinannya dengan Putri Sinar Alam, seorang putri dari Minak Jalan Ratu dari Kebandaran Keratuan Pugung, cikal-bakal pemegang kekuasaan di kebandakhan keratuan tersebut.Radin Intan II adalah putra tunggal Radin Imba II (28-34). Radin Imba II sendiri putra sulung Radin Intan I gelar Dalam Kesuma Ratu IV (51-28). Dengan demikian, Radin Intan II cucu dari Radin Intan I.",
        "fotourl" : "https://upload.wikimedia.org/wikipedia/commons/c/c1/Radin_Inten_II%2C_National_Hero_of_Indonesia.jpg"
      },
      {
        "nama": "Raja Ali Haji",
        "tanggal_lahir": "1809",
        "tanggal_meninggal": "1873",
        "provinsi": "Riau",
        "perjuangan": "Raja Ali Haji bin Raja Haji Ahmad (Jawi: راج علي حاج بن راج حاج احمد) atau juga dikenal dengan nama pena beliau adalah Raja Ali Haji (lahir di Pulau Penyengat, Kepulauan Riau, ca. 1808 - meninggal di Pulau Penyengat, Kesultanan Lingga (masa kini bagian dari Provinsi Kepulauan Riau), ca. 1873)[2][3] adalah ulama, sejarawan, dan pujangga abad 19 keturunan Bugis dan Melayu.[4] Dia terkenal sebagai pencatat pertama dasar-dasar tata bahasa Melayu lewat buku Pedoman Bahasa; buku yang menjadi standar bahasa Melayu. Bahasa Melayu standar (juga disebut bahasa Melayu baku) itulah yang dalam Kongres Pemuda Indonesia 28 Oktober 1928 ditetapkan sebagai bahasa nasional, bahasa Indonesia. Ia merupakan keturunan kedua (cucu) dari Raja Haji Fisabilillah, Yang Dipertuan Muda IV dari Kesultanan Lingga-Riau dan juga merupakan bangsawan Bugis."
        ,"fotourl" : "https://3.bp.blogspot.com/-ZbgqVarIDI4/UwNHFaJQiTI/AAAAAAAADis/bH2zOdYLawo/s1600/Raja+Haji+Fisabilillah.jpg"
      },
      {
        "nama": "Raden Mattaher",
        "tanggal_lahir": "1873",
        "tanggal_meninggal": "1907",
        "provinsi": "Jambi",
        "perjuangan": "Raden Mattaher tidak bisa dipisahkan dari Sultan Thaha Syaifuddin. Sebab, beliau merupakan sosok panglima perang tangguh yang dimiliki Sultan Thaha masa itu. Sosoknya dengan segudang taktik gerilya, Mattaher mampu menggempur serdadu Belanda. Oleh prajurit dan masyarakatnya dimasa itu, ia mendapat gelar Singo Kumpeh. Julukan itu diberikan karena keberingasannya layaknya singa dalam menumpas penjajah. Raden Mattaher bertugas sebagai panglima perang. Ia membentuk kantong-kantong dan barisan pertahanan serta barisan perlawanan yang bergerak di terotirial dari Muara Tembesi sampai ke Muaro Kumpeh. Pola serangan yang difokuskan Mattaher adalah dengan menyerang kapal-kapal perang Belanda yang masuk ke Jambi lewat jalur sungai. Kapal-kapal perang Belanda itu membawa personil, obat medis dan amunisinya. Berkat taktik perangnya yang memfokuskan pada pola menyerang kapal yang bermuatan personil tentara dan amunisinya itu, Mattaher paling ditakuti oleh tentara Belanda. Pada tahun 1885 Sultan Thaha dan Raden Mattaher berhasil menenggelamkan kapal perang Belanda di perairan Sungai Kumpeh Muaro Jambi. Peristiwa (penenggalaman kapal) itulah menjadi tonggak sejarah dan membuatnya digelari sebagai Singo Kumpeh.Perjuangan Raden Mattaher berakhir pada 10 September 1907. Ia ditembak mati di rumahnya sendiri dalam sebuah operasi militer Belanda. Raden Mattaher dimakamkan di komplek pemakaman raja-raja Jambi di tepi Danau Sipin Kota Jambi. Selain itu jari kelingking Mattaher juga dimakamkan di sebuah desa di Muaro Jambi.["
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Raden_Mattaher.jpg/330px-Raden_Mattaher.jpg"
      },
      {
        "nama": "Mohammad Husni Thamrin",
        "tanggal_lahir": "16 Februari 1894",
        "tanggal_meninggal": "11 Januari 1941",
        "provinsi": "Kepulauan Bangka Belitung",
        "perjuangan": "Pada tahun 1929 telah terjadi suatu insiden penting di dalam Gemeenteraad, yaitu yang menyangkut pengisiari lowongan jabatan wakil wali kota Betawi (Batavia). Tindakan pemerintah kolonial ketika itu memang sangat tidak bijaksana, karena ternyata lowongan jabatan itu diberikan kepada orang Belanda yang kurang berpengalaman, sedang untuk jabatan itu ada orang Betawi yang jauh lebih berpengalaman dan pantas untuk jabatan itu. Tindakan pemerintah ini mendapat reaksi keras dari fraksi nasional. Bahkan mereka mengambil langkah melakukan pemogokan, ternyata usaha mereka berhasil dan pada akhirnya Mohammad Husni Thamrin diangkat sebagai wakil wali kota Batavia."
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Mohammad_Husni_Thamrin.jpg/330px-Mohammad_Husni_Thamrin.jpg"
      },
      {
        "nama": "Hj Fatmawati",
        "tanggal_lahir": "5 Februari 1923",
        "tanggal_meninggal": "14 Mei 1980 (umur 57)",
        "provinsi": "Bengkulu",
        "perjuangan": "Hj. Fatmawati Soekarno (5 Februari 1923 – 14 Mei 1980)[1] adalah istri dari Presiden Indonesia pertama Soekarno. Ia menjadi Ibu Negara Indonesia pertama dari tahun 1945 hingga tahun 1967 dan merupakan istri ke-3 dari presiden pertama Indonesia yaitu Soekarno dan merupakan ibunda dari presiden kelima, Megawati Soekarnoputri. Ia juga dikenal akan jasanya dalam menjahit Bendera Pusaka Sang Saka Merah Putih yang turut dikibarkan pada saat upacara Proklamasi Kemerdekaan Indonesia di Jakarta pada tanggal 17 Agustus 1945."
        ,"fotourl" : "https://upload.wikimedia.org/wikipedia/id/1/18/Fatmawati_Soekarno.jpeg"
      },
      {
        "nama": "Teuku Umar",
        "tanggal_lahir": "1854",
        "tanggal_meninggal": "11 Februari 1899",
        "provinsi": "Aceh",
        "perjuangan": "Teuku Umar yang dilahirkan di Meulaboh Aceh Barat pada tahun 1854, adalah anak seorang Uleebalang bernama Teuku Achmad Mahmud dari perkawinan dengan adik perempuan Raja Meulaboh. Umar mempunyai dua orang saudara perempuan dan tiga saudara laki-laki. Nenek moyang Umar adalah Datuk Makhudum Sati berasal dari Minangkabau. Dia merupakan keturunan dari Laksamana Muda Nanta yang merupakan perwakilan Kesultanan Aceh pada zaman pemerintahan Sultan Iskandar Muda di Pariaman.[1] Salah seorang keturunan Datuk Makhudum Sati pernah berjasa terhadap Sultan Aceh, yang pada waktu itu terancam oleh seorang Panglima Sagi yang ingin merebut kekuasaannya. Berkat jasanya tersebut, orang itu diangkat menjadi Uleebalang VI Mukim dengan gelar Teuku Nan Ranceh. Teuku Nan Ranceh mempunyai dua orang putra yaitu Teuku Nanta Setia dan Teuku Ahmad Mahmud. Sepeninggal Teuku Nan Ranceh, Teuku Nanta Setia menggantikan kedudukan ayahnya sebagai Uleebalang VI Mukim. la mempunyai anak perempuan bernama Cut Nyak Dhien.[2]"
        ,"fotourl" : "https://assets-a1.kompasiana.com/statics/crawl/5568e50d0423bdb9518b4567.jpeg"
      }
    ]
  }
  